'''61) Алгоритм вычисления функции F(n) задан следующими соотношениями:
		F(n) =  n · n + 3 · n + 9, при n £ 15
		F(n) = F(n–1) + n – 2, при n > 15, кратных 3
		F(n) = F(n–2) + n + 2, при n > 15, не кратных 3
Определите количество натуральных значений n из отрезка [1; 1000], для которых все цифры значения F(n) чётные.'''
def F(n):
    if n<=15:
        return n*n+3*n+9
    if n>15 and n%3==0:
        return F(n-1)+n-2
    if n>15 and n%3!=0:
        return F(n-2)+n+2
count=0
for i in range(1,1001):
    s=str(F(i))
    if s.count("0")+s.count("2")+s.count("4")+s.count("6")+s.count("8")==len(s):
        count+=1
print(count)
'''ответ: 33'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''76) Алгоритм вычисления функции F(n), где n – целое число, 
задан следующими соотношениями:
F(n) = 1, при n £ 1,
F(n) = 3 + F(n / 2 – 1), когда n > 1 и чётное,
F(n) = n + F(n + 2) , когда n > 1 и нечётное.
Назовите минимальное значение n, для которого F(n) = 19.'''
def f(n):
    if n<=1:
        return 1
    elif n%2==0:
        return 3+f(n // 2-1)
    else:
        return 10**20
for i in range(1,100000):
    if f(i)==19:
        print(i)
        break
'''ответ: 126'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''126) (ЕГЭ-2022) Алгоритм вычисления функции F(n), где n – целое число, 
задан следующими соотношениями:
F(n) = 1, если n < 3
F(n) = F(n – 1) + n – 1, если n > 2 и число n чётное,
F(n) = F(n – 2) + 2·n – 2, если n > 2 и число n нечётное.
Вычислите значение F(34).'''
def G(n):
    if n<3:
        return 1
    elif n>2 and n%2==0:
        return G(n-1)+n-1
    elif n>2 and n%2!=0:
        return G(n-2)+2*n-2
print(G(34))
'''ответ: 578'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''Демо-2023) Алгоритм вычисления функции F(n), 
где n – натуральное число, задан следующими соотношениями:
F(n) = 1, если n = 1
F(n) = n · F(n – 1), если n > 1.
Чему равно значение выражения F(2023) / F(2020)?'''
'''2023*2022*2021*F(2020)//F(2020)-> ответ: 8266912626 '''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''Алгоритм вычисления значения функции F(n), где n –– натуральное число,
задан следующими соотношениями:
F(n) = n + 6 при n >= 5881;
F(n) = n + 4 + F(n + 1), если n < 5881
Чему равно значение выражения F(63) – F(70)?'''
from functools import *

@lru_cache(None)
def g(n):
    if n>=5881:
        return n+6
    elif n<5881:
        return n+4+g(n+1)
    
for i in range(5900,0,-1):
    g(i)
print(g(63)-g(70))
'''ответ: 490'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''