'''89)     89) Элементами множества А являются натуральные числа. Известно, что выражение
¬(x {2, 4, 6, 8, 10, 12})  (¬(x {3, 6, 9, 12, 15}) → (x A))
истинно (т. е. принимает значение 1) при любом значении переменной х.
Определите наименьшее возможное значение произведения элементов множества A.'''
num={2,4,6,8,10,12}
num1={3,6,9,12,15}
A=[]
for x in range(1,1000):
    if not(not(x in num)) and not(x in num1):
        A.append(x)
otv=1
for i in range(len(A)):
    otv*=A[i]
print(otv)
'''ответ: 640'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''90) Элементами множества А являются натуральные числа. Известно, что выражение
¬(x {1, 2, 3, 4, 5, 6})  (¬(x {3, 6, 9, 12, 15}) → (x A))
истинно (т. е. принимает значение 1) при любом значении переменной х.
Определите наименьшее возможное значение суммы элементов множества A.'''
num={1,2,3,4,5,6}
num1={3, 6, 9, 12, 15}
A=[]
for x in range(1,1000):
    if not(not(x in num)) and not(x in num1):
        A.append(x)
otv=0
for i in range(len(A)):
    otv+=A[i]
print(otv)
'''ответ: 12'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''96) Элементами множества А являются натуральные числа. Известно, что выражение
(x {2, 4, 8, 12, 15}) → (¬(x {3, 6, 8, 15})  (x A))
истинно (т. е. принимает значение 1) при любом значении переменной х.
Определите наименьшее возможное значение произведения элементов множества A.'''
num={2, 4, 8, 12, 15}
num1={3, 6, 8, 15}
A=[]
for x in range(1,1000):
    if (x in num) and not(x not  in num1):
        A.append(x)
otv=1
for i in range(len(A)):
    otv*=A[i]
print(otv)
'''ответ: 120'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''    105) На числовой прямой даны два отрезка: P = [44; 49] и Q = [28; 53].
 Укажите наибольшую возможную длину такого отрезка A, что формула

тождественно истинна, то есть принимает значение 1 при любом значении переменной х.'''
P=list(range(44,50))
Q=list(range(28,54))
A=list(range(-100,1000))
for x in range(-100,1000):
    if not(((x in A)<=(x in P)) or (x in Q)):
        A.remove(x)
print(A[-1]-A[0])
'''ответ: 25'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''    106) На числовой прямой даны два отрезка: P = [43; 49] и Q = [44; 53]. 
Укажите наибольшую возможную длину такого отрезка A, что формула

тождественно истинна, то есть принимает значение 1 при любом значении переменной х.'''
P=list(range(43,50))
Q=list(range(44,54))
A=list(range(-100,1000))
for x in range(-100,1000):
    if not(((x in A)<=(x in P)) or (x in Q)):
        A.remove(x)
print(A[-1]-A[0])
'''ответ: 10'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''    112) На числовой прямой даны два отрезка: P = [25, 50] и Q = [32, 47]. 
Отрезок A таков, что формула
 (¬ (x A) → ¬(x P)) → ( (x A) → (x Q)) 
тождественно истинна, то есть принимает значение 1 при любом значении переменной х. Какова наибольшая возможная длина отрезка A?'''
P=list(range(25,51))
Q=list(range(32,48))
A=list(range(0,100))
for x in range(-100,1000):
    if not(((x not in A)<=(x not in P))<=((x  in A)<=(x in Q))):
        A.remove(x)
print(A[-1]-A[0])
'''ответ: 15'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''499)      Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Для какого наименьшего натурального числа А формула
(ДЕЛ(x, 3) → ¬ ДЕЛ(x, 5)) \/ (x + A ≥ 70)
тождественно истинна, то есть принимает значение 1 при любом значении переменной х.'''
ans=0
for A in range(1,1000):
    ok=1
    for x in range(1,1000):
        F=((x%3==0)<= (x%5!=0))or (x+A>=70)
        if F==0:
            ok=0
            break
    if ok==1:
        print(A)
#ответ:55       
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''506)      Для какого наибольшего целого неотрицательного A выражение
(x + y ≤ 22) \/  (y ≤ x – 6) \/ (y ≥ A)
тождественно истинно, то есть принимает значение 1 при любых целых положительных значениях переменных х и y?'''
for A in range(1,1000):
    ok=1
    for x in range(1,1000):
        for y in range(1,1000):
            f=(x+y<=22) or (y<=x-6) or (y>=A)
            if f==0:
                ok=0
                break
    if ok==1:
        print(A)
#ответ: 9
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''507) Oбозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Для какого наименьшего целого неотрицательного A выражение
(ДЕЛ(x, 2) → ¬ДЕЛ(x, 3)) \/ (x + A ≥ 80)
тождественно истинно, то есть принимает значение 1 при любом натуральном значении переменной х?'''
ans=0
for A in range(1,1000):
    ok=1
    for x in range(1,1000):
        F=((x%2==0)<= (x%3!=0))or (x+A>=80)
        if F==0:
            ok=0
            break
    if ok==1:
        print(A)
#ответ: 74
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



