'''89)     89) Элементами множества А являются натуральные числа. Известно, что выражение
¬(x {2, 4, 6, 8, 10, 12})  (¬(x {3, 6, 9, 12, 15}) → (x A))
истинно (т. е. принимает значение 1) при любом значении переменной х.
Определите наименьшее возможное значение произведения элементов множества A.'''
num={2,4,6,8,10,12}
num1={3,6,9,12,15}
A=[]
for x in range(1,1000):
    if not(not(x in num)) and not(x in num1):
        A.append(x)
otv=1
for i in range(len(A)):
    otv*=A[i]
print(otv)
'''ответ: 640'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''90) Элементами множества А являются натуральные числа. Известно, что выражение
¬(x {1, 2, 3, 4, 5, 6})  (¬(x {3, 6, 9, 12, 15}) → (x A))
истинно (т. е. принимает значение 1) при любом значении переменной х.
Определите наименьшее возможное значение суммы элементов множества A.'''
num={1,2,3,4,5,6}
num1={3, 6, 9, 12, 15}
A=[]
for x in range(1,1000):
    if not(not(x in num)) and not(x in num1):
        A.append(x)
otv=0
for i in range(len(A)):
    otv+=A[i]
print(otv)
'''ответ: 12'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''96) Элементами множества А являются натуральные числа. Известно, что выражение
(x {2, 4, 8, 12, 15}) → (¬(x {3, 6, 8, 15})  (x A))
истинно (т. е. принимает значение 1) при любом значении переменной х.
Определите наименьшее возможное значение произведения элементов множества A.'''
num={2, 4, 8, 12, 15}
num1={3, 6, 8, 15}
A=[]
for x in range(1,1000):
    if (x in num) and not(x not  in num1):
        A.append(x)
otv=1
for i in range(len(A)):
    otv*=A[i]
print(otv)
'''ответ: 120'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''    105) На числовой прямой даны два отрезка: P = [44; 49] и Q = [28; 53].
 Укажите наибольшую возможную длину такого отрезка A, что формула

тождественно истинна, то есть принимает значение 1 при любом значении переменной х.'''
P=list(range(44,50))
Q=list(range(28,54))
A=list(range(-100,1000))
for x in range(-100,1000):
    if not(((x in A)<=(x in P)) or (x in Q)):
        A.remove(x)
print(A[-1]-A[0])
'''ответ: 25'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''    106) На числовой прямой даны два отрезка: P = [43; 49] и Q = [44; 53]. 
Укажите наибольшую возможную длину такого отрезка A, что формула

тождественно истинна, то есть принимает значение 1 при любом значении переменной х.'''
P=list(range(43,50))
Q=list(range(44,54))
A=list(range(-100,1000))
for x in range(-100,1000):
    if not(((x in A)<=(x in P)) or (x in Q)):
        A.remove(x)
print(A[-1]-A[0])
'''ответ: 10'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''



'''    112) На числовой прямой даны два отрезка: P = [25, 50] и Q = [32, 47]. 
Отрезок A таков, что формула
 (¬ (x A) → ¬(x P)) → ( (x A) → (x Q)) 
тождественно истинна, то есть принимает значение 1 при любом значении переменной х. Какова наибольшая возможная длина отрезка A?'''
P=list(range(25,51))
Q=list(range(32,48))
A=list(range(0,100))
for x in range(-100,1000):
    if not(((x not in A)<=(x not in P))<=((x  in A)<=(x in Q))):
        A.remove(x)
print(A[-1]-A[0])
'''ответ: 15'''
'''--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------'''